Revit 2024 API
UnitTypeId.KilonewtonMetersPerDegree Property
 Kilonewton meters per degree.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId KilonewtonMetersPerDegree { get; }
Visual Basic
Public Shared ReadOnly Property KilonewtonMetersPerDegree As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ KilonewtonMetersPerDegree {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace